QUESTION_KEYWORD_MAPPER = {
    "Q1": "一季度",
    "Q2": "二季度",
    "Q3": "三季度",
    "Q4": "四季度",
    "A/R": "应收账款",
    "AR": "应收账款",
    "AP": "应付账款",
    "A/P": "应付账款",
    "三费": "销售费用、管理费用、财务费用",
    "ROA": "总资产收益率",
    "ROE": "净资产收益率",
    "EBITDA": "息税折旧及摊销前利润",
    "EBIT": "息税前利润",
    "EPS": "基本每股收益",
    "同比": "同比",
    "环比": "环比"
}

LOCATE_FILE_FILTER_WORDS = ["信息", "科技", "有限", "公司", "股份", "电气", "电器", "保险", "控股", "集团", "制药", "智能", "证券", "有限公司", "科技股份", "网络", "网络科技", "数据", "报告", "年报", "季报", "一季报", "半年报", "三季报", "年度报告", "招股书", "pdf"]


QA_SYSTEM_V1 = "你是一个AI问答机器人"
QA_USER_V1 = """
你是一个AI问答机器人，请结合给出的问题和相关内容（包含表格Markdown和段落），严格按照要求回答问题。
要求如下：
- 在多个段落中有不同的答案，优先匹配最相关的段落并且靠前的段落；
- 表格和段落中都存在答案，优先选择段落的数据；
- 答案中存在数值并且存在给出的内容中，请返回原始数值，不要格式化；
- 答案可以通过计算得出，需要给出计算过程；
- 答案中有名词简称，请给出对应的全称，格式为"全称（简称）"；
- 回答文本中如果包含金额的数值，请包含千分位；
- 在给出的内容中未提供答案，请直接忽略相关内容，进行回答；


相关内容：```{context}```
问题：```{question}```
回答：
"""
